[
  {
    "Title": "Tutor",
    "Company": "Self-Employed",
    "Duration": "Dec 2017 - Present",
    "Summary": [
      "Started providing Secondary School English, Sciences and Humanities subjects from 2017",
      "Currently providing private computing tuition for both University courses and Pre- University Computer Science"
    ]
  },
  {
    "Title": "Software Engineer Intern",
    "Company": "Singapore E-Business Pte. Ltd.",
    "Duration": "May 2021 - Jul 2021",
    "Summary": [
      "Worked on Spring Boot project for a direct debit authorization service, with MySQL supporting database integrated using Hibernate object relation mapper.",
      "Learnt to develop process flows for conceptualising implementation of payment services such as cross border payments"
    ]
  },
  {
    "Title": "Software Engineer Intern",
    "Company": "Shopee Pte. Ltd.",
    "Duration": "May 2022 - July 2022",
    "Summary": [
      "Frontend Software Developer in Paid Ads team",
      "Developed React pages in Typescript as part of the latest major Paid-Ads project",
      "Libraries used in development: React, Vue.js",
      "Gained experience in manually configuring code bundler (Webpack) to set up critical features like transpiling typescript, code-splitting, uglification etc"
    ]
  },
  {
    "Title": "Software Engineer Intern",
    "Company": "Visa Worldwide Pte. Ltd.",
    "Duration": "May 2023 - July 2023",
    "Summary": [
      "Interned in Visa Direct team of Commercial and Money Movement Solutions (CMS)",
      "Developed a web application to create, manage and monitor automated tests on the projects under the Visa Direct team, utilizing Next.js for frontend and Spring Boot for the backend.",
      "Gathered user requirements from team and designed project from scratch, which included the supporting Oracle database and REST API endpoints for frontend-backend communication.",
      "Presented fully functional first iteration of the project to senior management near internship-end and handed off project to full-timers as a lasting internal project in the Visa Direct team."
    ]
  }
]
